app/views/messages/_message.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 122], ["LIMIT", 1]]
---

          <span class="white-font"> <%= message.user.first_name %> </span>