app/views/users/show.html.erb

            <div class="text-center">
              <% if !current_user.bands.all? { |band| band.user_is_member?(@user) } %>
---
SELECT "bands".* FROM "bands" INNER JOIN "band_members" ON "bands"."id" = "band_members"."band_id" WHERE "band_members"."user_id" = $1  [["user_id", 95]]