app/views/shared/_auditions_display.html.erb

    <div class="auditions-list">
      <% if @band.band_members.where(is_audition: true).empty? %>
---
SELECT "band_members".* FROM "band_members" WHERE "band_members"."band_id" = $1 AND "band_members"."is_audition" = $2  [["band_id", 15], ["is_audition", true]]
SELECT 1 AS one FROM "band_members" WHERE "band_members"."band_id" = $1 AND "band_members"."is_audition" = $2 LIMIT $3  [["band_id", 16], ["is_audition", true], ["LIMIT", 1]]


        <% @band.band_members.where(is_audition: true).each do |audition| %>
---
SELECT "band_members".* FROM "band_members" WHERE "band_members"."band_id" = $1 AND "band_members"."is_audition" = $2  [["band_id", 16], ["is_audition", true]]

            <div class="audition-details white-font">
              <p><%= audition.user.first_name %> wants to join your band!<p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]