app/views/shared/_band_display.html.erb

            <iframe src="<%= @band.spotify_embed_url %>" width="100%" height="380" frameBorder="0" allowtransparency="true" allow="encrypted-media"></iframe>
            <% if !@band.users.include?(current_user) %>
---
SELECT 1 AS one FROM "users" INNER JOIN "band_members" ON "users"."id" = "band_members"."user_id" WHERE "band_members"."band_id" = $1 AND "users"."id" = $2 LIMIT $3  [["band_id", 44], ["id", 143], ["LIMIT", 1]]

    <div class="band-members-container">
      <%@band.band_members.where(is_member: true).each do |record| %>
---
SELECT "band_members".* FROM "band_members" WHERE "band_members"."band_id" = $1 AND "band_members"."is_member" = $2  [["band_id", 44], ["is_member", true]]

        <% end %>
        <div class='ml-1'>- <%= record.user.first_name %> </div>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 91], ["LIMIT", 1]]