app/views/shared/_band_display.html.erb

SELECT "users".* FROM "users" INNER JOIN "band_members" ON "users"."id" = "band_members"."user_id" WHERE "band_members"."band_id" = $1  [["band_id", 15]]
SELECT 1 AS one FROM "users" INNER JOIN "band_members" ON "users"."id" = "band_members"."user_id" WHERE "band_members"."band_id" = $1 AND "users"."id" = $2 LIMIT $3  [["band_id", 27], ["id", 80], ["LIMIT", 1]]
---
            <p><%= @band.bio %></p>
            <% if !@band.users.include?(current_user) %>

SELECT "band_members".* FROM "band_members" WHERE "band_members"."band_id" = $1 AND "band_members"."is_member" = $2  [["band_id", 27], ["is_member", true]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 86], ["LIMIT", 1]]
---
    <div class="band-members-container">
      <%@band.band_members.where(is_member: true).each do |record| %>
         <%= image_tag "#{record.user.avatar_url}", class: "avatar audition-avatar" %>
          <div class='ml-1'>- <%= record.user.first_name %> </div>