app/views/shared/_chat_display.html.erb

SELECT 1 AS one FROM "messages" WHERE "messages"."band_id" = $1 LIMIT $2  [["band_id", 44], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."band_id" = $1  [["band_id", 44]]
---
        >
          <% if !@band.messages.empty? %>