app/views/shared/_navbar.html.erb

      <% if user_signed_in? %>
        <% if !current_user.bands.empty? %>
---
SELECT "bands".* FROM "bands" INNER JOIN "band_members" ON "bands"."id" = "band_members"."band_id" WHERE "band_members"."user_id" = $1  [["user_id", 119]]
SELECT 1 AS one FROM "bands" INNER JOIN "band_members" ON "bands"."id" = "band_members"."band_id" WHERE "band_members"."user_id" = $1 LIMIT $2  [["user_id", 95], ["LIMIT", 1]]

            <div class="band-dropdown-list dropdown-list hidden">
              <% current_user.bands.each do |band| %>
---
SELECT "bands".* FROM "bands" INNER JOIN "band_members" ON "bands"."id" = "band_members"."band_id" WHERE "band_members"."user_id" = $1  [["user_id", 95]]

              <% current_user.bands.each do |band| %>
                <% if band.band_members.where(user: current_user)[0].is_audition %>
---
SELECT "band_members".* FROM "band_members" WHERE "band_members"."band_id" = $1 AND "band_members"."user_id" = $2  [["band_id", 37], ["user_id", 95]]