app/channels/band_chat_channel.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
---
  def subscribed
    band_chat = Band.find(params[:id])