app/views/bands/index.html.erb

SELECT "users".* FROM "users" INNER JOIN "band_members" ON "users"."id" = "band_members"."user_id" WHERE "band_members"."band_id" = $1  [["band_id", 5]]
---
     <%= image_tag band.image_url %>
      <% band.users.each do |user| %>