app/views/bands/show.html.erb

SELECT 1 AS one FROM "users" INNER JOIN "band_members" ON "users"."id" = "band_members"."user_id" WHERE "band_members"."band_id" = $1 AND "users"."id" = $2 LIMIT $3  [["band_id", 16], ["id", 29], ["LIMIT", 1]]
---
    <p>Heavy Rocking Since 1999</p>
    <% if !@band.users.include?(current_user) %>

SELECT 1 AS one FROM "band_members" WHERE "band_members"."band_id" = $1 AND "band_members"."user_id" = $2 LIMIT $3  [["band_id", 16], ["user_id", 29], ["LIMIT", 1]]
SELECT "band_members".* FROM "band_members" WHERE "band_members"."band_id" = $1 AND "band_members"."user_id" = $2  [["band_id", 16], ["user_id", 29]]
---
<% @is_band_member = false %>
  <% if !@band.band_members.where(user: current_user).empty? %>
    <% @band_member_record = @band.band_members.where(user: current_user)[0] %>