app/controllers/band_members_controller.rb

INSERT INTO "band_members" ("user_id", "band_id", "is_member", "is_audition", "invitation_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 92], ["LIMIT", 1]]
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
---
  def create
    if params[:commit] == "Submit Audition"
      band_id = params[:band_id]
      audition = BandMember.new(audition_params)
      audition.is_audition = true
      audition.is_member = false
      audition.user = current_user
      audition.band_id = band_id
      audition.save!
      redirect_to band_path(band_id)
    end

    if params[:commit] == "Submit Invitation"
      musician_id = params[:musician_id]
      @band_member = BandMember.new(audition_params)
      @band_member.is_audition = false
      @band_member.is_member = false
      @band_member.user = User.find(musician_id)
      @band_member.band = Band.find(params[:band_member][:band])
      if @band_member.save