app/controllers/bands_controller.rb

  def index
    if params[:query].present?
      @bands = Band.global_search(params[:query])
    else
      @bands = Band.all
---
SELECT "bands".* FROM "bands" ORDER BY "bands"."id" ASC LIMIT $1  [["LIMIT", 1]]