app/controllers/bands_controller.rb

  def index
    # Failed Ajax attempt
    # @bands = Band.order(name: :asc, genre: :asc)
    # if params[:query].present?
    #   @bands = @bands.where('title ILIKE ?', "%#{params[:query]}%")
    # end

    if params[:query].present?
      if params[:result_type] == "bands"
        @results = Band.global_search(params[:query])
      elsif params[:result_type] == "musicians"
        @results = User.global_search(params[:query])
      else
        @bands = Band.global_search(params[:query])
        @users = User.global_search(params[:query])
        @results = @bands + @users
      end
    else
      @results = Band.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]