app/models/band.rb

SELECT "band_members".* FROM "band_members" WHERE "band_members"."band_id" = $1 AND "band_members"."is_member" = $2 AND "band_members"."user_id" = $3 LIMIT $4  [["band_id", 37], ["is_member", true], ["user_id", 95], ["LIMIT", 1]]
---
  def user_status(user)
    band_members.find_by(user: user).is_member? ? "member" : "auditioning"